backend: tensorflow
class_name: Sequential
config:
  layers:
  - class_name: Dense
    config:
      activation: relu
      activity_regularizer: null
      batch_input_shape: !!python/tuple
      - null
      - 161
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      dtype: float32
      kernel_constraint: null
      kernel_initializer:
        class_name: RandomNormal
        config:
          mean: 0.0
          seed: null
          stddev: 0.05
      kernel_regularizer: null
      name: dense_23
      trainable: true
      units: 50
      use_bias: true
  - class_name: Dense
    config:
      activation: softmax
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      kernel_constraint: null
      kernel_initializer:
        class_name: RandomNormal
        config:
          mean: 0.0
          seed: null
          stddev: 0.05
      kernel_regularizer: null
      name: dense_24
      trainable: true
      units: 3
      use_bias: true
  name: sequential_12
keras_version: 2.2.4
